Catalogs/НеденежныеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НеденежныеОбязательства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектПредоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыЗалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращенияСубъекта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОдобренияИсточником</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачиИмуществаСубъекту</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияИсполненияОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксированияИзмений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НенадлежащееИсполнениеОбязательства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UIDНБКИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаимодавца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастичноДругойКредитор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозникновенияОбязательства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСрокаРассмотренияОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельКредита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиКредита</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОбращения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НеденежныеОбязательства/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		ОбъектОбязательства = ДанныеЗаполнения.Ссылка;
		Наименование = "Неденежное обязательство..."; 
	КонецЕсли;	 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		ОбъектОбязательства = ДанныеЗаполнения.Ссылка;  
	КонецЕсли;
КонецПроцедуры  

Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(ОбъектОбязательства) Или Не ЗначениеЗаполнено(ОбъектПредоставления) Тогда
		Сообщить("Заполните Объект обязательства и Объект предоставления!");
		Отказ = Истина;
	КонецЕсли;	
	Наименование = Строка(ОбъектПредоставления) + ": " + Строка(ОбъектОбязательства);
		
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	КредитныеИстории.УдалитьСобытияИсточника(ОбъектОбязательства, ЭтотОбъект.Ссылка); 
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ДатаОбращенияСубъекта >= НачалоДня(ТекущаяДатаСеанса()) Тогда
		
		
		Если ЗначениеЗаполнено(ДатаОбращенияСубъекта) И (Не ЗначениеЗаполнено(ДатаОдобренияИсточником) И Не ЗначениеЗаполнено(ДатаПередачиИмуществаСубъекту)) Тогда 
			СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "1.1"); 
			Если Не СобытиеЗафиксировано Тогда 
				КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаОбращенияСубъекта, ЭтотОбъект.Ссылка, "1.1");  
			КонецЕсли;
		КонецЕсли;	
		
		
		Если (ЗначениеЗаполнено(ДатаОбращенияСубъекта) И ЗначениеЗаполнено(ДатаОдобренияИсточником)) И Не ЗначениеЗаполнено(ДатаПередачиИмуществаСубъекту) Тогда
			СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "1.2"); 
			Если Не СобытиеЗафиксировано Тогда 
				КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаОбращенияСубъекта, ЭтотОбъект.Ссылка, "1.2");  
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(UIDНБКИ) И ЗначениеЗаполнено(ДатаПередачиИмуществаСубъекту) Тогда
			СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "1.4"); 
			Если Не СобытиеЗафиксировано Тогда 
				КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаОбращенияСубъекта, ЭтотОбъект.Ссылка, "1.4");  
			КонецЕсли;
			
			СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "2.2"); 
			Если Не СобытиеЗафиксировано Тогда 
				КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаОбращенияСубъекта, ЭтотОбъект.Ссылка, "2.2");  
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "1.3"); 
		Если Не СобытиеЗафиксировано Тогда 
			КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаОбращенияСубъекта, ЭтотОбъект.Ссылка, "1.3");  
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДатаФиксированияИзмений) и ЗначениеЗаполнено(UIDНБКИ) Тогда
		СобытиеЗафиксировано = КредитныеИстории.СобытиеСделкиЗафиксированоИсточником(ОбъектОбязательства, ЭтотОбъект.Ссылка, "2.1"); 
		Если Не СобытиеЗафиксировано Тогда 
			КредитныеИстории.ЗаписатьСобытиеСделки(ОбъектОбязательства, ДатаФиксированияИзмений, ЭтотОбъект.Ссылка, "2.1");  
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
